---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
source: html/3945b3ac-4ec9-8b7d-92e8-37b89995c5fe.htm
---
# AnalysisDisplayColoredSurfaceSettings Members

Constructs a default instance of colored surface settings.